### Creating Dataframes using different methods

In [1]:
import pandas as pd
import numpy as np

#### Finding datatypes

In [4]:
my_series=pd.Series([1,2,3,4,5])
print(my_series.dtype)

int64

#### Converting to list

In [5]:
print(my_series.to_list())

[1, 2, 3, 4, 5]

### 1. Dataframe using list of lists

In [10]:
scores=[['English',90,'A'],['Malayalam',95,'A'],['Science',88,'B'],['Mathematics',98,'A'],['Hindi',75,'C'],['History',70,'C'],['Geography',65,'D'],['Computer',92,'A'],['Art',89,'B'],['PE',90,'A']]
my_df=pd.DataFrame(scores,columns=['Subject','Score','Grade'])
my_df

       Subject  Score Grade
0      English     90     A
1    Malayalam     95     A
2      Science     88     B
3  Mathematics     98     A
4        Hindi     75     C
5      History     70     C
6    Geography     65     D
7     Computer     92     A
8          Art     89     B
9           PE     90     A

### 2. Dataframe using dictionaries

In [11]:
scores={
    'Subject':["English","Malayalam","Science","Mathematics","Hindi","History","Geography","Computer","Art","PE"],
    'Score':[90,95,88,98,75,70,65,92,89,90],
    'Grade':['A','A','B','A','C','C','D','A','B','A']
}
my_df=pd.DataFrame(scores)
my_df

       Subject  Score Grade
0      English     90     A
1    Malayalam     95     A
2      Science     88     B
3  Mathematics     98     A
4        Hindi     75     C
5      History     70     C
6    Geography     65     D
7     Computer     92     A
8          Art     89     B
9           PE     90     A

### 3. Dataframe using list of dictionaries

In [12]:
scores=[
    {'SUBJECT':'English','SCORE':90,'GRADE':'A'},
    {'SUBJECT':'Malayalam','SCORE':95,'GRADE':'A'},
    {'SUBJECT':'Science','SCORE':88,'GRADE':'B'},
    {'SUBJECT':'Mathematics','SCORE':98,'GRADE':'A'},
    {'SUBJECT':'Hindi','SCORE':75,'GRADE':'C'},
    {'SUBJECT':'History','SCORE':70,'GRADE':'C'},
    {'SUBJECT':'Geography','SCORE':65,'GRADE':'D'},
    {'SUBJECT':'Computer','SCORE':92,'GRADE':'A'},
    {'SUBJECT':'Art','SCORE':89,'GRADE':'B'},
    {'SUBJECT':'PE','SCORE':90,'GRADE':'A'},
    
]
my_df=pd.DataFrame(scores)
my_df

       SUBJECT  SCORE GRADE
0      English     90     A
1    Malayalam     95     A
2      Science     88     B
3  Mathematics     98     A
4        Hindi     75     C
5      History     70     C
6    Geography     65     D
7     Computer     92     A
8          Art     89     B
9           PE     90     A